import { Title, NewsBlock, Container, Subtitle, Divider } from '@/components';
import { APP_NAME, product_categories as categories, principles } from '@/constants/constants';
import Image from 'next/image';
import Link from 'next/link';
import React from 'react';

export const metadata = {
  title: `${APP_NAME} | Про нас`,
};

const Page: React.FC = () => {
  return (
    <div className="font-black">
      <div className="flex h-20 items-center bg-[#bad444]">
        <Title text="Про нас" className="text-3xl text-white" />
      </div>
      <Container>
        <div className="my-10 flex flex-col gap-4 lg:flex-row">
          <div className="my-2 flex flex-2 flex-col gap-8">
            <Image src="/img/about/about.png" alt="About" width={1000} height={100} />
            <Title text="BUFET" />
            <p className="">
              BUFET багато років є улюбленим місцем студентів та родин із дітьми. Ми постійно
              розвиваємося. Наша перша піцерія була відкрита в Харкові у 2002 році. Сьогодні в
              мережі 19 піцерій. Нас легко знайти, адже BUFET завжди знаходиться поруч – у місцях із
              зручним транспортним сполученням, аби Ви в будь-який час могли насолодитися своїми
              улюбленими стравами. Серед наших відвідувачів не тільки харків’яни, а й чимало гостей
              з інших міст України.
            </p>
            <Title text="Місія" />
            <p className="">Дарувати радість від ситних смачних страв за демократичною ціною.</p>
            <Title text="Мета" />
            <p className="">Смачна їжа якісно й швидко.</p>
            <Title text="Цiнностi" />
            <ul className="flex flex-col gap-2">
              {principles.map((item) => (
                <li key={item.id} className="flex items-center gap-4">
                  <span className="w-10 shrink-0 rounded-full bg-orange-500 p-1 text-center text-xl text-white">
                    ✓
                  </span>
                  {item.text}
                </li>
              ))}
            </ul>
            <p className="">
              Ми працюємо задля того, аби кожен відвідувач залишився задоволений. Дотримуємося
              найвищих стандартів сервісу та якості й проявляємо максимум уваги до кожного
              відвідувача та його побажань.
            </p>
            <p className="">
              Основна страва, яку Вам запропонують у мережі BUFET – це піца. Ми готуємо за власними
              фірмовими рецептами й на будь-який смак. Тут свою улюблену піцу знайдуть і
              шанувальники ситних страв, і ті, хто дбає про фігуру й здоровий спосіб життя та рахує
              калорії. Наша піца дійсно смачна, адже приготована з натуральних якісних продуктів без
              ГМО, що проходять ретельний контроль якості. Вона подобається всім – і малечі й
              дорослим.
            </p>
            <p className="">
              У нашій мережі готують дев’ять видів піци. В «Меню» Ви знайдете інформацію про те, які
              саме продукти в кожному рецепті. Тісто замішуємо з найкращої муки твердих сортів
              пшениці. Для приготування піци використовуємо сир «Чеддер». Це натуральний сир
              виготовлений з молочних продуктів без використання рослинних жирів. Якщо Вам більше
              подобається піца з м’ясом, помідорами й зеленню – то піца «М’ясна» саме для Вас. Вона
              користується найбільшою популярністю у наших відвідувачів. Якщо ж Ви віддаєте перевагу
              рецептам із меншою кількістю калорій – замовте піцу «З грибами», «Курка з ананасом»
              або «Фітнес».
            </p>
            <Subtitle text="У НАС НАЙСМАЧНІША ПІЦА В ХАРКОВІ!" className="text-orange-500" />
            <p className="">
              Для мережі BUFET важлива думка кожного відвідувача. Завдяки Вам у нас є можливість
              постійно вдосконалюватися.
            </p>
            <p className="">
              BUFET – велика команда. Наші співробітники – впевнені та цілеспрямовані особистості,
              котрі можуть й люблять працювати в команді. Ми цінуємо ініціативу та творчість кожного
              й надаємо максимум можливостей для реалізації своїх здібностей. Ми завжди раді вітати
              в команді мережі BUFET ініціативних і відповідальних людей.
            </p>
            <p className="">
              Ми займаємося упорядкуванням території, аби прогулюючись, Ви могли трохи відпочити й
              присісти на лавочку біля нашого закладу, а влітку насолодитися прохолодою в тіні
              дерев.
            </p>

            <p className="">
              Ми – за активний спосіб життя й всіляко підтримуємо велосипедний рух і стараємося
              забезпечити комфорт, як для піших гостей, так і для гостей із власним транспортом.
              Тому обладнали наші заклади стійками для велосипедів. До більшості піцерій BUFET легко
              під’їхати й на автомобілі, наприклад, за горнятком запашної ранкової кави.
            </p>
            <p className="">
              Наша компанія не працює за франшизою. Продаж продукції здійснюється тільки через наші
              піцерії.
            </p>
            <p className="">
              BUFET – це смачна піца в затишній атмосфері. Будемо раді бачити Вас і ваших друзів та
              рідних у мережі BUFET. Обслугуємо швидко, нагодуємо смачно й за доступною ціною.
            </p>
          </div>
          <div className="flex-1">
            <Subtitle text="Меню" />
            <ul className="flex flex-col items-center">
              {categories.map((category) => (
                <li
                  key={category.id}
                  className="leading-5 font-extrabold text-orange-500 capitalize transition hover:text-[#9dba23]"
                >
                  <Link href={category.href}>{category.title}</Link>
                </li>
              ))}
            </ul>
            <NewsBlock />
          </div>
        </div>
        <Divider />
      </Container>
    </div>
  );
};

export default Page;
